Repository: ivaradi/jsprog
Catalog: po/*.po
Languages: hu

source: _Actions
hu: _Műveletek

source: This tab displays the table of the actions the operation of each control should evoke. The left side of the table shows the controls of the joystick, including the virtual ones defined for the joystick type or the profile. The cells of the table display the names of the actions defined for the controls, if any. Click in any of the action fields to create an action or to edit an existing one. An action always belongs to a state or state change. In case of buttons, an action belongs to the pressed state of the button, i.e. the action is executed when the button is pressed. In case of axes, the actions are invoked when the axis is deflected or moved, i.e. when its value or state changes. In case of virtual controls the actions are invoked when the virtual control enters the state the action belongs to. Some action types allow the definition of some 'leave' activity, which is executed when the state the action belongs to is left. In case of buttons it means the releasing of the button. In case of axes it means a change in the value, i.e. when an axis is moved and its value changes, the leave activity for the old value is executed followed by the action for the new value, if any. One can also define one or more shift levels. A shift level is a set of virtual states, that can be used to achieve different behaviour for the controls depending on the states of certain other controls. One of the simplest examples is to define a button as the 'shift' button on your joystick, so that if that button is pressed, some or all controls execute actions different from those executed when that button is not pressed. But an arbitrary number of states can be defined with different combinations of button, axis and/or virtual control states. There can also be several shift levels to be able to combine those. For example, some joysticks have a mode selector button or wheel, and the different modes could be used for different games, plus a shift button to alter the behaviour of the other controls. If there are one or more shift levels, the table contains columns for each combinaton of the shift level states, thus a different action can be specified for each such combination.
hu: Ez a fül tartalmazzó az egyes vezérlők kezelésekor indítandó műveletek táblázatát. A táblázat bal oldalán sorakoznak a botkormány vezérlői a típusához vagy a profilban megadott virtuális vezérlőkkel együtt. A táblázat mezői a vezérlőkhöz megadott műveletek nevét tartalmazzák, ha van ilyen művelet. A mezőbe való kattintásra ott egy új művelet hozható létre vagy a meglévő szerkeszthető. A művelet mindig egy állapothoz, állapotátmenethez tartozik. Gombok esetén ez állapot a gomb benyomott állapota, azaz a művelet a gomb benyomásakor fut le. Tengelyeknél a műveletet a tengely mozgásakor hajtjuk végre, azaz amikor a tengely értéke, vagyis állapota változik. Virtuális vezérlő esetében a művelet akkor fut le, amikor a vezérlő abba az állapotba lép, amelyhez a művelet tartozik. Egyes művelettípusokhoz külön "kilépési" tevékenység adható meg, amely az állapot elhagyásakor hajtandó végre. Gombok esetén ez a gomb felengedését jelenti. Tengelyeknél az érték változását, azaz amikor a tengely mozog és megváltozik az értéke, a régi értékhez tartozó kilépési tevékenység fut le, utána pedig az új érték belépési tevékenysége, ha bármalyik is létezik. Egy vagy több váltó szint is megadható. Egy váltó szint virtuális állapotokból áll, amelyek segítségével elérhető, hogy egyes vezérlők más vezérlők állapotától függően más és más műveletet hajtsanak végre. Az egyik legegyszerűbb példa az, ha egy gombot 'váltógombként' kezelünk, és ha azt a gombot benyomják, akkor egyes vezerlők vagy az összes többi vezérlő más műveletet hajt végre, mint a váltógomb felengedett állapotában. A váltó szintekhez tetszőleges számú állapot adható meg különböző gomb, tengely és/vagy virtuális vezérlő állapotok kombinációjaként. Továbbá több váltó szint is létezhet, hogy azok állapotainak összes kombinációja külön programozható legyen. Például egyes botkormányok rendelkeznek egy módváltó gombbal vagy görgővel. Ilyenkor a módváltót használhatjuk különböző játékokhoz, és emellett egy váltógombbal befolyásolhatjuk a többi vezérlő viselkedését. Ha több váltó szint van, akkor a táblázatban a szintek állapotainak összes kombinációhoz találunk oszlopot, így mindegyikhez más és más művelet adható meg.

source: _Virtual controls
hu: _Virtuális vezérlők

source: This tab displays any virtual controls defined in the current profile. These virtual controls are available besides the ones defined for the joystick type.
hu: Ez fül tartalmazza a jelenlegi profilban definiált virtuális vezérlőket. Ezek a vezérlők is használható a botkormány típushoz definiáltak mellett.

source: _Daemon XML
hu: _Démon XML

source: Add shift level
hu: Űj emelő szint

source: Edit shift level
hu: Emelő szint szerkesztése

source: Edit profile name
hu: Profilnév szerkesztése

source: New profile
hu: Új profil

source: Copy profile
hu: Profil másolása

source: Copy of
hu: Másolat

source: Are you sure to remove profile '{0}'?
hu: Biztosan töröljük a(z) '{0}' profilt?

source: Profiles
hu: Profilok

source: Quit
hu: Kilépés

source: Load a new icon file
hu: Új ikon fájl betöltése

source: Reset the icon to the default one
hu: Az ikon visszaállítása az alapértelmezettre.

source: Are you sure to reset the icon to the default one?
hu: Biztosan visszaállítsuk az ikont az alapértelmezettre?

source: Icon
hu: Ikon

source: This is the icon displayed in the joysticks view window for joysticks of this type. It can be the same as one of the images used for the views, but a smaller one or even a drawing may be more appropriate, if the view image is too detailed or does not look good as an icon in the joystick window on both light and dark backgrounds.
hu: Ez az ikon jelenik a botkormányokat tartalmazó ablakban az ilyen típusú botkormányokhoz. Lehet ugyanaz a képfájl, amelyet valamelyik nézethez használunk, de egy kisebb fájl vagy akár egy rajz jobb is lehet, ha a nézet képe túl részletes, vagy ikonként nem néz ki igazán jól világos és sötét háttéren.

source: Indicator icon
hu: Indikátor ikon

source: This is the icon displayed in the status bar for joysticks of this type. Since such icons may not be visible on the normal background of the window, they are displayed on a checkerboard background. They are also displayed larger than is usual in the status bar.
hu: Ez az ikon jelenik meg az állapotsorban az ilyen típusú botkormányokhoz. Mivel az ilyen ikonok nem mindig látható jól az ablak szokásos háttere előtt, egy sakktáblaszerű háttéren jelenítjük meg azt. Emellett nagyobbnak is látszanak itt, mint általában az állapotsorban.

source: Select view image
hu: Kép a nézethez

source: Image files
hu: Képfájlok

source: All files
hu: Minden fájl

source: Should the image be copied to your JSProg device directory?
hu: A képet átmásoljuk a saját JSProg eszközkönyvtárba?

source: The image is not in any of the standard locations, so JSProg will not find it later. If you answer 'yes', it will be copied to your user device directory %s.
hu: A kép nem található a szabványos mappák egyikében sem, így a JSProg nem fogja később megtalálni. Ha igennel válaszolunk, a képet a(z) %s felhasználói eszközkönyvtárba másolja a program.

source: File copying failed
hu: A fájl másolása meghiúsult.

source: Joystick editor
hu: Botkormány szerkesztő

source: View:
hu: Nézet:

source: Each joystick type can have one or more views, which are photos and/or drawings of the joystick from different angles or of different parts of it, if the controller consists of more parts (e.g. a joystick and a throttle lever). To mark the different controls on the joystick, one can place hotspots on it. A hotspot displays the name of the control as set in the right side of this window. A hotspot can optionally have a dot to pinpoint the control better, or if the controls are so close to each other, that the names would not fit next to each other.
hu: Minden botkormány típushoz tartozhat egy vagy több nézet, amelyek a botkormányt különböző szögekből vagy annak különböző részeit (pl. a kormányt és hozzá tartozó gázkart) ábrázoló fényképek és/vagy rajzok. A botkormány egyes vezérlőinek megjelöléséhez jelölőket helyezhetünk el a képen. A jelölő tartalmazza a vezérlőnek az ablak jobb oldalán lévő táblázatokban beeállított nevét. Emellett tartalmazhat egy pontot is, amellyel pontosabban megjelölhető a vezérlő, vagy abban az esetben, ha a vezérlők túl közel vannak egymáshoz és a címkék egymásba csúsznának.

source: Edit the current view's name
hu: Az aktuális nézet nevének szerkesztése

source: Add new view
hu: Új nézet hozzáadása

source: Remove the current view
hu: Az aktuális nézet törlése

source: Buttons
hu: Gombok

source: Axes
hu: Tengelyek

source: _Physical controls
hu: _Fizikai vezérlők

source: This tab displays the physical controls of the joystick, grouped as buttons and axes. Each control has a physical name, as the system sees it. However, it often does not match the real name of the control as printed onto the joystick's surface. The real name can be set in the 'Name' column. Click twice on a name to make it editable. To help identifying the controls, you can activate one (i.e. press a button or move an axis), and the corresponding entry in the table will be moved into view, if necessary, and highlighted.
hu: Ez a fül a botkormány fizikai vezérlőit tartalmazza, külön csoportban a gombokat és a tengelyeket. Mindegyik vezérlőnek van egy fizikai neve, ahogyan a rendszer látja azt. Ez azonban gyakran nem egyezik azzal a névvel, amit a botkormányon feltüntettek. Ez a valódi név a 'Név' oszlopban állítható be. Egy név akkor szerkeszthető, ha kétszer rákattintunk. A vezérlők azonosításához aktíválhatjuk azokat (azaz megnyomhatjuk a gombot, vagy kitéríthetjük a tengelyt), amelynek hatására a vezérlőhöz tartozó sor a táblázatban a látható részbe kerül és ki lesz emelve.

source: This tab displays the virtual controls defined for the joystick.
hu: Ez a fül tartalmazza a botkormányhoz megadott virtuális vezérlőket.

source: _Icons
hu: _Ikonok

source: This tab shows the icons associated with the joystick type.
hu: Ez a fül tartalmazza a botkormány típus ikonjait.

source: Click twice on a name in the Name column to edit it.
hu: A Név oszlopban kattintsunk kétszer egy névre a szerkesztéséhez.

source: Identifier
hu: Azonosító

source: Name
hu: Név

source: Failed to save the joystick definition
hu: Nem tudtam elmenteni a botkormány adatait

source: View #%d
hu: %d. nézet

source: <span color="#ff0000"><b>There is already a view with this name, choose another one!</b></span>
hu: <span color="#ff0000"><b>Már van ilyen nevű nézet, válasszunk másik nevet!</b></span>

source: Are you sure to remove view '{0}'?
hu: Biztosan töröljük a(z) '{0}' nevű nézetet?

source: Virtual State
hu: Virtuális állapot

source: The name of the state. It must be unique among the states of the virtual control.
hu: Az állapot neve. A virtuális vezérlő többi állapota között egyedinek kell lennie.

source: Control
hu: Vezérlő

source: Value(s)
hu: Érték(ek)

source: This is the table of the constraints of the {0}. Each constraint consists of a control and a corresponding state of that control. In case of a button, it is either pressed or released. In case of an axis it is a range of values.{1} To select a different control, click on its name, and select the new control from the popup list. If the control is a button, click on the value to toggle between 'released' and 'pressed'. In case of an axis, click on the value (range) to change it into two number entry fields for the lower and upper limits of the range. Click again to accept the current values.{2}
hu: Ez a táblázat tartalmazza {0} feltételeit. Mindegyik feltétel egy vezérlőből és annak egy állapotából áll. Egy gomb esetében az állapot vagy a benyomott vagy a felengedett helyzet. Tengelynél az állapot az értékek egy tartománya.{1} A vezérlő kiválasztásához kattintsunk a jelenlegi nevére és a feljövő listából válasszuk ki a kívánt vezérlőt. Ha a vezérlő gomb, kattintsuk az értékre a 'benyomott' és 'felengedett' állapotok közötti váltáshoz. Tengely esetén kattintsunk az érték(tartomány)ra, aminek hatására ott két számbeviteli mező jelenik meg a tartomány alsó és felső határának szerkesztéséhez. Kattintsunk újra az értékek elfogadásához.{1}

source: shift state
hu: az emelő állapot

source: virtual state
hu: a virtuális állapot

source: In case of a virtual control it is a virtual state of that control.
hu: Virtuális vezérlő esetében annak egy virtuális állapota.

source: For a virtual control, a combo box is displayed with its states. Simply select the one you need.
hu: Virtuális vezérlő esetén egy kombinált listából választhatjuk ki a kívánt állapotot.

source: Edit the selected virtual state.
hu: A kiválaszott virtuális állapot szerkesztése

source: Move up the selected virtual state.
hu: A kiválaszott virtuális feljebb mozgatása

source: Move down the selected virtual state.
hu: A kiválaszott virtuális lejjebb mozgatása

source: Add a new virtual state.
hu: Új virtuális állapot hozzáadása.

source: Add default
hu: Üres hozzáadása

source: Add a default virtual state. The default state is considered to be active when the constraints of no other state hold. There is no need to have a default state, but may come handy.
hu: Üres állapot hozzáadása. Az üres állapotot akkor tekintjük aktívnak, ha egyik másik állapot feltételei sem teljesülnek. Nem szükséges üres állapotot megadnunk, de hasznos lehet bizonyos esetekben.

source: State
hu: Állapot

source: Constraints
hu: Feltételek

source: The profile contains action(s) for this shift state. Those actions will also be removed.
hu: A profilban van(nak) ehhez az emelő állapothoz tartozó művelet(ek). Ezeket a műveleteket is törölni fogjuk.

source: The state has action(s) in the profile. Those actions will also be removed.
hu: Az állapothoz tartozik művelet a profilban, amely szintén törlésre kerül.

source: The state has actions in one or more profiles. Those actions will also be removed.
hu: Az állapothoz egy vagy több profilban tartozik művelet. Ezek is törlésre kerülnek.

source: Are you sure to remove the selected virtual state?
hu: Biztosan töröljük a kiválasztott virtuális állapotot?

source: _Apply
hu: _Alkalmaz

source: No virtual state is selected.
hu: Nincs kiválasztott virtuális állapot.

source: A virtual control must have at least two states.
hu: Egy virtuális vezérlőnek legalább két állapottal kell rendelkeznie.

source: The state cannot be deleted, because it is referenced from a shift state.
hu: Az állapot nem törölhető, mert emelő állapotból hivatkoznak rá.

source: Remove the virtual state.
hu: A virtuális állapot törlésre

source: The name of the virtual control.
hu: A virtuális vezérlő neve.

source: Should be unique for the profile.
hu: A profilon belül egyedinek kell lennie.

source: Should be unique for the joystick type.
hu: A botkormány típusra nézve egyedinek kell lennie.

source: _Base control:
hu: _Kiindulási vezérlő:

source: The name of the control to use as the 'base' control for the {0}. The base control is a physical button or axis, which is used to generate the constraints for the initial states. In case of a button being the base control, those states are the released and pressed state of that button; in case of an axis, the range of the axis is split into two halves to provide the constraints.{1} These initial states can, of course, be fully edited later.
hu: {0} 'alap' vezérlőjének neve. Az alapvezérlő egy olyan fizikai gomb vagy tengely, amelynek alapján állítjuk elő a vezérlő kezdeti állapotainak feltételeit. Ha az alapvezérlő gomb, akkor ezek a feltételek a gomb lenyomott és felengedett állapotai lesznek. Tengely esetén annak értéktartományát félbe vágjuk és ez a két tartomány adja a két kezdeti állapot feltételeit.{1} E kezdeti állapotok természetesen teljes körűen megváltoztathatók később.

source: shift level
hu: Az emelő szint

source: virtual one
hu: A virtuális vezérlő

source: For a virtual control, a state will be created for each of its states.
hu: Virtuális vezérlő esetén annak minden állapotához létrejön egy-egy állapot.

source: A virtual control is created by the user for logical functions that are realized by several physical controls. One example is a hat switch, which is typically made up of two axes. A virtual control has a name which is displayed and is editable in the top part of the tab. Select a name and click on it again to edit it. If a virtual control's name is selected, its states are displayed below. Each state has a name and a number of constraints that determine when that state is considered the active one. A constraint is made up of a physical control and its state. In case of the hat switch example, it is possible that there is a state called 'Up' (meaning that the hat switch is deflected upwards), and the corresponding constraints can state that the 'Up' state is active, if the X-axis of the switch is in the centre position (e.g. value 0) and its Y-axis is in the upwards position (e.g. value 1). In the lower part a state can be edited, moved up and down, and removed. The order of the states determines which one will be considered active in a certain situation, if more than one state could be selected based on their constraints.
hu: A virtuális vezérlőket a felhasználó hozza létre olyan logikai funkciókhoz, amelyeket több fizikai vezérlő valósít meg. Erre példa a hat switch, amit általában két tengellyel oldanak meg. Egy virtuális vezérlő rendelkezik a fül felső részében látható és szerkeszthető névvel. Válasszuk ki a nevet és kattintsunk rá még egyszer a szerkesztéshez. Ha kiválasztjuk egy virtuális vezérlő nevét, az állapotai jelennek meg alul. Mindegyik állapotnak van egy neve és egy vagy több feltétele, amelyek teljesülésekor az az állapot válik aktívvá. A feltétel egy fizikai vezérlőből és annak valamilyen állapotából áll. A hat switch példánál maradva, lehet egy "Fel" állapotunk (amely azt jelenti, hogy a kapcsolót felfelé billentjük), a hozzá tartozó feltétel szerint pedig akkor van a vezérlő ebben az állapotban, ha a kapcsoló X-tengelye középső állásban van (az értéke pl. 0), az Y-tengelye pedig felfelé tér ki (pl. 1 az értéke). Az alsó részben az állapotok szerkeszthetők, fel-le mozgatható és törölhetők. Az állapotok sorrendje is meghatározza, hogy adott esetben melyik az aktív, ha több állapot feltételei is teljesülnek.

source: No virtual control is selected.
hu: Nincs kiválasztott virtuális vezérlő.

source: New virtual control
hu: Új virtuális vezérlő

source: The control has actions in one or more profiles. Those actions will also be removed.
hu: A vezérlőhöz egy vagy több profilban tartozik művelet, amelyek szintén törlésre kerülnek.

source: The control has action(s) in the profile. Those actions will also be removed.
hu: A vezérlőhöz tartozik művelet a profilban, amely szintén törlésre kerül.

source: Are you sure to remove the selected virtual control?
hu: Biztosan töröljük a kiválasztott virtuális vezérlőt?

source: Remove the selected virtual control.
hu: A kiválaszott virtuális vezérlő törlése.

source: The selected virtual control cannot be removed, because it is referenced from a shift state in this profile.
hu: A kiválaszott virtuális vezérlő nem törölhető, mert a profilból egy emelő állapotból hivatkoznak rá.

source: The selected virtual control cannot be removed, because it is referenced from a shift state in one of the profiles.
hu: A kiválasztot virtuális vezérlő nem törölhető, mert az egyik profil emelő állapotából hivatkoznak rá.
