Repository: ivaradi/jsprog
Catalog: po/*.po
Languages: hu

source: Joystick Programmer
hu: Botkormány Programozó

source: Flexible programming of your joysticks
hu: A botkormányok sokoldalú programozása

source: {0} is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
hu: A {0} szabad szoftver: a Free Software Foundation által kiadott GNU General Public License 2-es vagy (tetszés szerint) bármely későbbi verziójának feltételei szerint terjeszthető és/vagy módosítható.

source: (joystick)
hu: (botkormány)

source: Profile: '{0}'
hu: Profil: '{0}'

source: Added
hu: Csatlakoztatva

source: Downloaded profile
hu: Profile letöltve

source: Profile download failed
hu: A profil letöltése meghiúsult

source: Removed
hu: Kihúzva

source: This is the currently downloaded profile, but it has been modified since it was downloaded. Download it again to make the changes effective.
hu: Ez a jelenleg letöltött profil, de a letöltés óta már módosult. Töltsd le megint a változtatások érvényre juttatásához.

source: This is the currently downloaded profile.
hu: Ez a jelenleg letöltött profil.

source: Select the profile to download it to the joystick.
hu: Válassuk ki a profilt a botkormányba való letöltéshez.

source: Edit _profiles
hu: _Profilok szerkesztése

source: Edit the profiles belonging to a joystick.
hu: A botkormányhoz tartozó profilok szerkesztése.

source: _Edit
hu: _Szerkesztés

source: Edit the joystick type information.
hu: A botkormány típus szerkesztése.

source: _Version: %04x
hu: _Verzió: %04x

source: Copy the version to the currently edited profile.
hu: A verzió másolása az éppen szerkesztett profilba.

source: _Physical location: %s
hu: _Fizikai elérési út: %s

source: Copy the physical location to the currently edited profile.
hu: A fizikai elérési út másolása az éppen szerkesztett profilba.

source: _Unique ID: %s
hu: _Egyedi azonosító: %s

source: Copy the unique identifier to the currently edited profile.
hu: Az egyedi azonosító másolása az éppen szerkesztett profilba.

source: Co_ntrol:
hu: Ve_zérlő:

source: The control the hotspot represents.
hu: A jelölő által jelölt vezérlő.

source: _Font:
hu: _Betűtípus:

source: The font to use to display the control's name in the hotspot label.
hu: A jelölő címkéjében a vezérlő nevének megjelenítéséhez használt betűtípus.

source: Text
hu: Szöveg

source: Background
hu: Háttér

source: Normal
hu: Normál

source: Select this to have the hotspot displayed in the normal, non-highlighted state.
hu: Válasszuk ki ezt a jelölő a normál, nem kiemelt állapotában való megjelenítéséhez.

source: Highlighted
hu: Kiemelt

source: Select this to have the hotspot displayed in the highlighted state.
hu: Válasszuk ki ezt a jelölő a kiemelt állapotában való megjelenítéséhez.

source: The color of the text of the hotspot label in the normal, non-highlighted state.
hu: A jelölő címkéje szövegének a normál, nem kiemelt állapotban való megjelenítéséhez használt szín.

source: The color of the background of the hotspot label in the normal, non-highlighted state.
hu: A jelölő címkéje hátteréhez a normál, nem kiemelt állapotban való megjelenítéséhez használt szín.

source: The color of the text of the hotspot label in the highlighted state.
hu: A jelölő címkéje szövegének a kiemelt állapotban való megjelenítéséhez használt szín.

source: The color of the background of the hotspot label in the highlighted state.
hu: A jelölő címkéje hátteréhez a kiemelt állapotban való megjelenítéséhez használt szín.

source: S_election color
hu: K_ijelölés színe

source: The color of the border drawn around the label of the hotspot when the hotspot is selected.
hu: A jelölő címkéje köré a jelölő kiválasztásakor rajzolt keret színe.

source: Colors
hu: Színek

source: Dot _radius:
hu: Pont _sugara:

source: The radius of the hotspot's dot. As you change the value, the display is updated.
hu: A jelölő pontjának sugara. Az érték változtatásakor a nézet is frissül.

source: _Line width:
hu: _Vonalvastagság:

source: The width of the line connecting the hotspot's label and dot. As you change the value, the display is updated.
hu: A jelölő címkéjét és pontját összekötő vonal vastagsága. Az érték változtatásakor a nézet is frissül.

source: Dot
hu: Pont

source: Line
hu: Vonal

source: The color of the dot of the hotspot in the normal, non-highlighted state.
hu: A jelölő pontjának színe a normál, nem kiemelt állapotban.

source: The color of the line connecting the hotspot's label and dot in the normal, non-highlighted state.
hu: A jelölő címkéjét és pontját összekötő vonal színe a normál, nem kiemelt állapotban.

source: The color of the dot of the hotspot in the highlighted state.
hu: A jelölő pontjának színe a kiemelt állapotban.

source: Sh_ow dot
hu: Pont _mutatása

source: Enable to show a dot for the hotspot.
hu: Kapcsoljuk be, ha a jelölőhöz pontot is szeretnénk.

source: Click somewhere in this window, to place a hotspot. If you click on a hotspot, the editor for that hotspot will be displayed. You can also drag a hospot to move it. If the hotspot has a dot, the dot can be moved independently.
hu: Kattintsunk valahová az ablakban egy jelölő elhelyezéséhez. Ha rákattintuk egy jelölőre, annak szerkesztő ablaka jelenik meg.A jelölőt és az esetleg hozzá tartozó pontot húzhatjuk is.

source: Are you sure to delete the hotspot?
hu: Biztosan töröljük a jelölőt?

source: Joysticks
hu: Botkormányok

source: _About
hu: _Névjegy

source: This window displays the joysticks connected to your computer. Click on a joystick icon to select it. The secondary menu then becomes available allowing the downloading of a profile to the joystick and access to the windows to edit the joystick's type or profiles. Right-clicking on a joystick also displays a menu with the same functions. If you have application indicators enabled on your system, you also have a status icon for each joystick containing the same menu items.
hu: Ebben az ablakban láthatók a számítógéphez csatlakoztatott botkormányok. Egy eszköz kiválasztásához kattintsunk az ikonjára. Ekkor a másodlagos menü aktívvá válik és lehetővé teszi profil letöltését, valamint a botkormány típusának és profiljának a szerkesztését. Jobb gombos kattintás esetén egy ugyanezen funkciókat tartalmazó menü jelenik meg. Ha a rendszer kezeli az alkalmazás indikátorokat, az egyes botkormányokhoz egy-egy státuszikon is tartozik, amelynek menüjéből szintén elérhetők ezek a lehetőségek.

source: _Name:
hu: _Név:

source: _File name:
hu: _Fájlnév:

source: _Version:
hu: _Verzió:

source: When matching the profile for automatic loading, this value, if not empty, will be used as an extra condition. The value should be hexadecimal.
hu: Az automatikusan betöltendő profil keresésekor, ha az az érték nem üres, extra feltételként szerepel. Az értéknek hexadecimálisnak kell lennie.

source: _Physical location:
hu: _Fizikai elérési út:

source: When matching the profile for automatic loading, this value, if not empty, will be used as an extra condition.
hu: Az automatikusan betöltendő profil keresésekor, ha az az érték nem üres, extra feltételként szerepel.

source: _Unique ID:
hu: _Egyedi azonosító:

source: _Auto-load profile
hu: _Automatikus betöltés

source: If selected, the profile will be a candidate to be loaded automatically when a matching joystick is connected. If any of the version, the physical location or the unique identifier is given, the more specific the match will be. If the unique identifiers match that trumps everything.
hu: Ha ki van jelölve, a profil automatikusan letöltődhet hozzá illő botkormány csatlakoztatásakor. Ha verzió, a fizikai elérési út és/vagy az egyedi azonosító ki van töltve, a leginkább egyező profilt választja a program. Ha az egyedi azonosító egyezik, az mindent felülbírál.

source: Default
hu: Alapértelmezett

source: released
hu: felengedve

source: pressed
hu: lenyomva

source: Click in the field below to enter a new key combination.
hu: Kattints a lenti mezőbe új billentyűkombináció beviteléhez.

source: Click in the field below to enter a new key.
hu: Kattints a lenti mezőbe új billentyű beviteléhez.

source: key combination
hu: billentyűkombinációt

source: key
hu: billentyűt

source: Press the %s to be added. Click in the entry field below to cancel.
hu: Üsd le a %s a bevitelhez. Kattints a lenti beviteli mezőbe a bevitel elvetéséhez.

source: Append a new key combination
hu: Új billentyűkombináció hozzáadása

source: Remove the currently selected key combination
hu: A kijelölt billentyűkombináció törlése.

source: Key combinations
hu: Billentyűkombinációk

source: R_epeat the key combinations
hu: A billentyűkombinációk ismétlése

source: When selected, the key combination(s) will be repeated as long as the control is in the appropriate state (e.g. a button is pressed).
hu: Ha ki van jelölve, a billentyűkombináció(k) addig ismétlődnek, míg a vezérlő a megfelelő állapotban van (pl. a gomb le van nyomva).

source: If the key combinations are to be repeated as long as the control is active, there should be a delay between the repetitions and its length is determined by the contents of this field. The value is in milliseconds
hu: Ha a vezérlő aktív állapota esetén ismételni szeretnénk a billentyű-kombinációkat, az egyes ismétlések között szünetnek kell lenni, amelynek a hosszát ennek a mezőnek a tartalma határozza meg. Az érték milliszekundumban van.

source: Add key combination
hu: Új billentyűkombináció

source: Are you sure to remove the selected key combination?
hu: Biztosan töröljük a kijelölt billentyűkombinációt

source: Direction:
hu: Irány:

source: _Horizontal
hu: _Vízszintes

source: If selected, the action will produce a horizontal mouse pointer movement.
hu: Ha ez van kiválasztva, a művelet vízszintes egérmozgást eredményez.

source: _Vertical
hu: _Függőleges

source: If selected, the action will produce a vertical mouse pointer movement.
hu: Ha ez van kiválasztva, a művelet függőleges egérmozgást eredményez.

source: _Wheel
hu: _Görgő

source: If selected, the action will produce a mouse wheel movement.
hu: Ha ez van kiválasztva, a művelet az egérgő mozgatását eredményezi.

source: Ad_justment:
hu: _Eltolás

source: This adjusment value will be subtracted from the value of the control to produce adjustedValue
hu: Ezt az eltolást a vezérlő értékéből vonjuk ki, hogy megkapjuk az eltoltÉrtéket.

source: The distance the mouse pointer is to be moved or the wheel spun is determined from adjustedValue as follows: A + B*adjustedValue + C*adjustedValue^2
hu: Az egérmutató vagy a görgő mozgásának a távolságát az eltolÉrtékből számolja ki a program így: A + B*eltoltÉrték + C*eltoltÉrték^2.

source: R_epeat the mouse movement
hu: _Ismétlődő egérmozgás

source: When selected, the mouse movement will be repeated as long as the control is in the appropriate state (e.g. the axis is deflected).
hu: Ha ez ki van választva, az egérmozgás addig ismétlődik, amig a vezerlő a megfelelő állapotban van (pl. a tengely ki van térítve).

source: If the mouse movement is to be repeated as long as the control is active, there should be a delay between the repetitions and its length is determined by the contents of this field. The value is in milliseconds.
hu: Ha az egérmozgást ismételni kell, amíg a vezérlő aktív, az egyes ismétlések között szünetnek kell lennie, amelynek hosszát ennek a mezőnek a tartalma határozza meg. Az érték milliszekundumban értendő.

source: _Cancel
hu: _Mégsem

source: _Save
hu: M_entés

source: _Add
hu: _Hozzáadás

source: _Delay:
hu: _Késleltetés:

source: Press %s
hu: %s lenyomása

source: Release %s
hu: %s felengedése

source: Mouse
hu: Egér

source: horizontal
hu: vízszintesen

source: vertical
hu: függőlegesen

source: wheel
hu: görgő

source: Delay %d ms
hu: %d ms késlelteés

source: Key _press
hu: Billentyű _lenyomás

source: Add a new key press command
hu: Új billentyű lenyomás parancs hozzáadása

source: Key _release
hu: Billentyű _felengedés

source: Add a new key release command
hu: Új billentyű felengedés parancs hozzáadása

source: _Mouse move
hu: _Egér mozgás

source: Add a new mouse move command
hu: Új egér mozgás parancs hozzáadása

source: _Delay
hu: _Szünet

source: Add a new delay command
hu: Új szünet parancs hozzááadása

source: Edit the selected command
hu: A kiválasztott parancs szerkesztése

source: Move up the selected command
hu: A kiválasztott parancs feljebb mozgatása

source: Move down the selected command
hu: A kiválasztott parancs lejjebb mozgatása

source: Delete the selected command
hu: A kiválaszott parancs törlése

source: Commands
hu: Parancsok

source: Add a key press
hu: Új billentyű lenyomás

source: Add a key release
hu: Új billentyű felengedés

source: Add a mouse move
hu: Új egér mozgás

source: Add a delay
hu: Új szünet

source: Edit the key press
hu: Billentyű lenyomás szerkesztés

source: Edit the key release
hu: Billentyű felengedés szerkesztés

source: Edit the mouse move
hu: Egér mozgás szerkesztés

source: Edit the delay
hu: Várakozás szerkesztés

source: Are you sure to remove the selected command?
hu: Biztosan töröljük a kiválasztott parancsot?

source: _Enter
hu: _Belépés

source: _Repeat
hu: _Ismétlés

source: Check to enable a separate set of repeat commands. If they are enabled, they will be repeated while the control is active. Otherwise the enter commands will.
hu: Jelöljük ki, ha az ismétlések során más parancssorozatot szeretnénk végrehajtani. Ha nincs erre külön parancssorozat, a belépéskor lefutót ismétli a program.

source: _Leave
hu: _Kilépés

source: R_epeat the commands
hu: Parancsok _ismétlése

source: When selected, the commands will be repeated as long as the control is in the appropriate state (e.g. the axis is deflected). If the separate sequence of repeat commands is enabled, those commands will be repeated. Otherwise the entry commands will.
hu: Ha ki van jelölve, a parancsok addig ismétlődnek, amíg a vezérlő megfelelő állapotban van (pl. egy tengely ki van térítve). Ha külön ismétlődő parancssorozatot adtunk meg, azokat a parancsokat ismétli a program, egyébként a belépéskor lefutókat.

source: If the commands are to be repeated as long as the control is active, there should be a delay between the repetitions and its length is determined by the contents of this field. The value is in milliseconds.
hu: Ha a parancsokat ismételni kell a vezérlő aktív állapotában, az egyes ismétlések között szünetet kell tartani, és annak a hosszát határozza meg ennek a mezőnek a tartalma. Az érték milliszekundumban értendő.

source: JSProg provides several global constants and functions that can be used in the Lua script snippets for actions. The constants provided are the codes of the controls, i.e. keys and axes. The names of the constants (as any symbols provided by JSProg) start with 'jsprog_' and followed by the identifier of the control as defined in linux/input-event-codes.h. The following global functions are provided: * jsprog_iskeypressed(code): return a boolean indicating if the key with the given code is pressed. * jsprog_getabs(code): get the value of the absolute axis with the given code. * jsprog_getabsmin(code), jsprog_getabsmax(code): get the minimum/maximum value of the absolute axis with the given code. * jsprog_presskey(code), jsprog_releasekey(code): emit an input event indicating that the key with the given code has been pressed/released. * jsprog_moverel(code, distance): emit an input event indicating that the relative control with the given code has been moved by the given distance. * jsprog_startthread(function): start a Lua thread (coroutine) executing the given function and return that thread. * jsprog_delay(delay[, cancellable]): delay the execution for the given amount of time in milliseconds (int). cancellable is a boolean indicating of the delay may be cancelled by a call to jsprog_canceldelay(). * jsprog_canceldelay(thread): if the given thread is in a cancellable delay, cancel that delay. * jsprog_jointhread(thread): join the given Lua thread and wait for it exiting.
hu: A JSProg több globális konstants és függvényt ad, amelyek a műveletkhez tartozó Lua script részletekeben felhasználhatók. A konstansok a vezérlők, azaz a gombok és a tengelyek kódjai. A nevük (mint az összes, a JSProg által biztosított szimbólumé) a "jsprog_" karaktersorozattal kezdődik, amelyet a vezérlőnek a linux/input-event-codes.h fejléc fájlban szereplő azonosítója követ. Az alábbi globális függvényekat adja a program: * jsprog_iskeypressed(code): egy logikai értékkel tér vissza, amely jelzi, hogy a megadott kódú gomb be van-e nyomva. * jsprog_getabs(code): visszaadja a megadott kódú tengely értékét. * jsprog_getabsmin(code), jsprog_getabsmax(code): visszaadják a megadott kódú tengely legkisebb/legnagyobb lehetséges értékét. * jsprog_presskey(code), jsprog_releasekey(code): olyan beviteli eseményt bocsájtanak ki, amelyik a megadott kódú billentyű lenyomását/elengedését jelzik. * jsprog_moverel(code, distance): olyan beviteli eseményt bocsájt ki, amelyik a megadótt kódú vezérlő adott távolsággal való elmozdulását jelzi. * jsprog_startthread(function): egy Lua szálat (korutint) indít a megadott függvénnyel és visszaadja annak a szálnak a referneciájt. * jsprog_delay(delay[, cancellable]): a végrehajtást felfüggeszti a milliszekundomban megadott időre. Ha a cancellable logikai érték igaz, akkor a várakozás megszakítható a jsprog_canceldelay() függvény hívásával. * jsprog_canceldelay(thread): ha a megadott szál éppen felfüggeszti a a futását megszakítható módon, akkor azt a felfüggesztést megszakítja. * jsprog_jointhread(thread): csatlakozik a megadott Lua szálhoz, és bevárja annak kilépését.

source: _Range:
hu: _Tartomány

source: The value range of the axis which the action belongs to.
hu: A tengely értékeinak tartománya, amelyhez a lenti művelet tartozik.

source: Edit the current value range
hu: Az aktuális értéktartomány szerkesztése

source: Add a new value range
hu: Új értéktartomány hozzáadása

source: Remove the selected value range. If this is the only range, it will be expanded to cover the whole range of the axis.
hu: A kijelölt értéktartomány törlése. Ha ez az egyetlen értéktartomány, akkor csak kiterjesztjük a tengely teljes értéktartományára.

source: S_imple
hu: _Egyszerű

source: Select this to have a simple action. A simple action is a series of key combinations. You can add and remove key combinations using the buttons below.
hu: Ennek a kijelölésével egyszerű műveletet kapunk. Egy egyszerű művelet billentyűkombinációk sorozata. A lent látható gombokkal adhatunk hozzá új billentyűkombinációkat, illetve törölhetünk meglévőket.

source: Select this to have a mouse move action. A mouse move action produces a horizontal or vertical movement of the mouse pointer or a movement of the mouse wheel. The amount of the movement (or speed of it in case of repetition being enabled) produced depends on the value of the control, hence it is most useful with axes. For the formula of how much movement is produced, see the tooltips of the values below.
hu: Ennek kijelölésével egérmozgató műveletet kapunk. Az egérmozgató művelet hatására a egérmutató vízszintesen vagy függőlegesen mozog, vagy a görgő "teker". A mozgás mértéke (vagy ismétlés esetén a sebessége) a vezérlő értékétől függ, így ez a fajta művelet leginkább tengelyekkel használható. A mozgás mértékének a képlete a lenti értékek tippjében olvasható.

source: _Advanced
hu: Öss_zetett

source: Select this to have an advanced action. An advanced action is a sequence of more elementary commands, key presses, releases, mouse movements and/or delays. Also, separate command sequences can be defined to be executed when the control enters the state the advanced action belongs to, and when that state is left. Repetition can be enabled here as well, and a separate command sequence can be given for the repeats. If no such command sequence is given, the entry sequence will be repeated.
hu: Ennek kijelölésével összetett műveletet kapunk. Egy összetett művelet egyszerűbb parancsok, azaz billentyűlenyomások, -felengedések, egérmozgások és/vagy késleltetések sorozata. Más sorozat adható meg a művelethez tartozó állapotba való belépéshez, és az abból való kilépéshez. Ismétlésre is van lehetőség, amelyhez megadható külön parancssorozat is, de ha ilyen nincs, akkor a belépéskor végrehajtott sorozat ismétlődik.

source: Select this to have a script action. A script action consists of two Lua script to be executed when the control enters the state the action belongs to and when that state is left. The code entered is placed into a function with no arguments or return value. As of this writing, the version 5.2 of the Lua interpreter is used. No modules are available in the execution environment, but JSProg provides a number of functions that can be called. Their description is found in the tooltip of the script entry field below.
hu: Ennek a kijelölésével script műveletet kapunk. Egy script művelet két Lua scriptből áll: az egyik a művelethez tartozó állapotba való belépéskor, a másik annak elhagyásakor fut le. A beírt kódrészlet egy paraméterek és visszatérési érték nélküli függvénybe kerül majd. Jelenleg a Lua értelmező 5.2-es verzióját használja a program. A környezetben modulok nem érjetők el, de a JSProg biztosít néhány saját globális függvényt, amelyeket meghívhatunk. A leírásuk a lenti beviteli mezők tippjében olvasható.

source: Edit value range
hu: Értéktartomány szerkesztése

source: Add value range
hu: Új értéktartomány

source: Are you sure to expand the range to cover the full range of the axis?
hu: Biztosan kiterjesszük az értéktartományt a tengely teljes terjedelmére?

source: Are you sure to remove the selected value range?
hu: Biztos töröljük a kijelölt értéktartományt?

source: Edit action
hu: Művelet szerkesztése

source: Save the modifications to the action.
hu: A művelet módosításainak mentése.

source: Clear the action.
hu: A művelet törlése

source: adjust
hu: eltolás

source: Are you sure to clear the action?
hu: Biztosan töröljük a műveletet?

source: Insert a new shift level after this one.
hu: Új emelő szint beszúrása ez után.

source: Remove this shift level.
hu: Az emelő szint törlése.

source: Edit this shift level.
hu: Az emelő szint szerkesztése.

source: Add a new top shift level.
hu: Új legfelső emelő szint hozzáadása.

source: Remove shift level
hu: Emelő szint törlése.

source: If you are sure to remove the shift level, select the state below for which the actions should be kept:
hu: Ha biztosan töröljük az emelő szintet, válasszuk ki lent az állapotot, amelynek a műveleteit meg kell őrizni:

source: State constraints
hu: Állapot feltételek

source: Profiles Editor
hu: Profilszerkesztő

source: Profiles editor
hu: Profilszerkesztő

source: Profile:
hu: Profil:

source: You can select the profile to be edited. Several profiles can be defined for each joystick type. A profile determines what actions must be executed when one or more controls of the joystick is operated. Typically different profiles are meant for different games or applications.
hu: Kiválaszható a szerkesztendő profil. Minden botkormány típushoz több profil definiálható. A profile határozza meg, hogy a botkormány vezérlőinek kezelésekor milyen műveletek fussanak le. A különböző profilok tipikusan különböző játékokhoz tartoznak.

source: Edit the current profile's name and/or file name
hu: Az aktuális profil nevének és/vagy fájlnevének a szerkesztése

source: Add new profile
hu: Új profil hozzáadása

source: Remove the current profile
hu: Az aktuális profil törlése

source: Create a new profile as the copy of the current profile
hu: Az aktuális profil másolása új profilba

source: Vie_w:
hu: _Nézet

source: Select the view of the joystick to show below.
hu: Válaszd ki a lent megjelenítendő nézetet.
